from platform import python_branch

"""
python代码的三种波浪线
1.红色
红色波浪线代表代码的错误 必须处理，代码才能执行
注意：在后续课程中代码没有写完 也会出现报错

2.灰色
灰色波浪线 不会影响代码的运行 
PEP8：python代码的书写规范 代码不按这个规范书写 会给灰色波浪线 建议书写按照Pep8书写
几乎所有的灰色波浪线都是格式问题
书写时要注意规范 书写完成之后可以使用ctrl alt l  来格式化代码
3.绿色

绿色波浪线也是不影响代码的正常执行
在引号当中认为你书写的不是一个英文单词，就会显示绿色







变量：用来存储数据中出现的数据想要保存下来  那就必须使用变量 如 测试数据。用户名，密码，验证码
变量注意实现：变量必须先定义（保存数据）后使用（取出数据）


定义变量

变量名=数据值     #可以理解为是将数据值保存到变量

使用变量：
变量定义之后  想要使用变量中的数据，直接使用变量名即可
比如：
name="张三" #定义一个变量name，存储的一个数据值是张三
#使用变量获取数据打印
print(name)






"""